# RefersToExternalResourceReferences Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..RefersToExternalResourceReferences Method
Element Class See Also
---
Determines whether this Element uses external resources.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool RefersToExternalResourceReferences()
```

Visual Basic
---
```text
Public Function RefersToExternalResourceReferences As Boolean
```

Visual C++
---
```text
public:
bool RefersToExternalResourceReferences()
```

# ### Return Value
True if this element uses external resources, false if it does not.
# Remarks
Some elements may contain references to data from external resources. These elements contain one or more ExternalResourceReferences.
# See Also
Element Class
Autodesk.Revit.DB Namespace